# Join Statements - Lab

## Introduction

In this lab, you'll practice your knowledge of join statements, using various types of joins and various methods for specifying the links between them.

## Objectives

You will be able to:
- Write queries that make use of various types of Joins
- Join tables using foreign keys

## CRM Schema

In almost all cases, rather then just working with a single table you will typically need data from multiple tables. 
Doing this requires the use of **joins ** using shared columns from the two tables. 

In this lab, you'll use the same Customer Relationship Management (CRM) database that you saw from the previous lesson.
<img src='images/Database-Schema.png' width="600">

## Connecting to the Database
Import the necessary packages and connect to the database **data.sqlite**.

In [2]:
#Your code here
import pandas as pd
import sqlite3
conn = sqlite3.connect("data.sqlite")
c = conn.cursor()

In [3]:
def sql (querry ,cursor = c):
    """Runs a SQL querry and returns results as a Dataframe. cursor Variable is set to 'c' by default. Make sure your run sql_connect before using or set cursor manually """
    c.execute(querry)
    c.fetchall
    df = pd.DataFrame(c.fetchall())
    df.columns = [x[0] for x in c.description]
    return df

## Display the names of all the employees in Boston.
Hint: join the employees and customers tables.

In [4]:
sql("""select * from sqlite_master""")

,type,name,tbl_name,rootpage,sql
0,table,orderdetails,orderdetails,2,"CREATE TABLE `orderdetails` (`orderNumber`, `p..."
1,table,payments,payments,28,"CREATE TABLE `payments` (`customerNumber`, `ch..."
2,table,offices,offices,32,"CREATE TABLE `offices` (`officeCode`, `city`, ..."
3,table,customers,customers,33,"CREATE TABLE `customers` (`customerNumber`, `c..."
4,table,orders,orders,38,"CREATE TABLE `orders` (`orderNumber`, `orderDa..."
5,table,productlines,productlines,46,"CREATE TABLE `productlines` (`productLine`, `t..."
6,table,products,products,47,"CREATE TABLE `products` (`productCode`, `produ..."
7,table,employees,employees,56,"CREATE TABLE `employees` (`employeeNumber`, `l..."

In [5]:
#Your code here
sql("""select lastName,firstName 
from 
employees as e join offices as o 
on e.officeCode = o.officeCode 
where city = "Boston";""")

    lastName firstName
0   Firrelli     Julie
1  Patterson     Steve

## Do any offices have no employees?
Hint: Combine the employees and offices tables and use a group by.

In [8]:
#Your code here
sql(""" SELECT lastName, firstName, customerNumber
from 
customers as c join employees as e 
on c.salesRepEmployeeNumber = e.employeeNumber
""")

     lastName firstName customerNumber
0   Hernandez    Gerard            103
1    Thompson    Leslie            112
2      Fixter      Andy            114
3   Hernandez    Gerard            119
4       Jones     Barry            121
5    Jennings    Leslie            124
6       Jones     Barry            128
7    Jennings    Leslie            129
8      Vanauf    George            131
9   Hernandez    Gerard            141
10      Jones     Barry            144
11   Castillo    Pamela            145
12     Bondur      Loui            146
13      Nishi      Mami            148
14      Tseng  Foon Yue            151
15  Patterson     Steve            157
16   Jennings    Leslie            161
17      Marsh     Peter            166
18      Jones     Barry            167
19      Tseng  Foon Yue            168
20  Hernandez    Gerard            171
21     Bondur      Loui            172
22   Firrelli     Julie            173
23     Vanauf    George            175
24      Nishi      Mami            177
25      Tseng  Foon Yue            181
26       Bott     Larry            186
27       Bott     Larry            187
28      Jones     Barry            189
29  Patterson     Steve            198
..        ...       ...            ...
70  Patterson     Steve            362
71  Patterson     Steve            363
72     Gerard    Martin            376
73   Firrelli     Julie            379
74   Castillo    Pamela            381
75   Castillo    Pamela            382
76      Nishi      Mami            385
77   Castillo    Pamela            386
78      Nishi      Mami            398
79     Bondur      Loui            406
80      Marsh     Peter            412
81      Jones     Barry            415
82      Tseng  Foon Yue            424
83     Vanauf    George            447
84      Jones     Barry            448
85   Jennings    Leslie            450
86   Castillo    Pamela            452
87      Tseng  Foon Yue            455
88      Tseng  Foon Yue            456
89     Gerard    Martin            458
90  Patterson     Steve            462
91     Fixter      Andy            471
92   Castillo    Pamela            473
93   Thompson    Leslie            475
94     Gerard    Martin            484
95     Vanauf    George            486
96   Jennings    Leslie            487
97       Bott     Larry            489
98   Firrelli     Julie            495
99      Marsh     Peter            496

[100 rows x 3 columns]

## Write 3 Questions of your own and answer them

In [ ]:
# Answers will vary

In [ ]:
# Your code here

In [ ]:
# Your code here

In [ ]:
# Your code here

## Level Up: Display the names of each product each employee has sold

In [ ]:
# Your code here
sql(""" SELECT o.officeCode ,city , count(employeeNumber) as  employees 
from 
offices as o left join employees as e 
on e.officeCode = o.officeCode
group by e.officeCode
""")

## Level Up: Display the Number of Products each employee has sold

In [ ]:
#Your code here

## Summary

Congrats! You now know how to use join statements, along with leveraging your foreign keys knowledge!